Саракташ2/src/Documents/Корректировка/Корректировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Корректировка</name>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Саракташ2/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/Documents/Корректировка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Свернуть ТЧ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тчТовары.Склад КАК Склад,
	|	тчТовары.Номенклатура КАК Номенклатура,
	|	тчТовары.Количество КАК Количество
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&тчТовары КАК тчТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Склад КАК Склад,
	|	втТовары.Номенклатура КАК Номенклатура,
	|	СУММА(втТовары.Количество) КАК Количество
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Склад,
	|	втТовары.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(втТовары.Количество) <> 0";
	
	Запрос.УстановитьПараметр("тчТовары", Товары.Выгрузить(,"Склад, Номенклатура, Количество"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.Запасы.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.Запасы.Добавить();
		
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Выборка.Склад;
		
		Если Выборка.Количество > 0 Тогда
			
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Количество = Выборка.Количество;
			
		Иначе
			
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Количество = Выборка.Количество * - 1;
			
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры
